content/posts/How_to_construct_and_debug_a_dockerfile.md
+++
title = "How to construct and debug a dockerfile"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:34:42-04:00
slug = "How_to_construct_and_debug_a_dockerfile"
draft = false
+++

## [Debugging a Dockerfile \* Docker Bootcamp](<https://subscription.packtpub.com/book/virtualization%5Fand%5Fcloud/9781787286986/6/ch06lvl1sec38/debugging-a-dockerfile>) {#debugging-a-dockerfile-docker-bootcamp--https-subscription-dot-packtpub-dot-com-book-virtualization-and-cloud-9781787286986-6-ch06lvl1sec38-debugging-a-dockerfile}


## simplest example of a custom dockerfile that does not inherit from one of those provided by the deeplearning images and successfully runs on ai platform notebooks {#simplest-example-of-a-custom-dockerfile-that-does-not-inherit-from-one-of-those-provided-by-the-deeplearning-images-and-successfully-runs-on-ai-platform-notebooks}


## GCP AI platform notebooks custom images {#gcp-ai-platform-notebooks-custom-images}


### [How to Create Customized Deep Learning Containers – Zain Rizvi's blog](<https://zainrizvi.io/blog/create-custom-deep-learning-containers/>) {#how-to-create-customized-deep-learning-containers-zain-rizvi-s-blog--https-zainrizvi-dot-io-blog-create-custom-deep-learning-containers}


### [Requirements for launching Google Cloud AI Platform Notebooks with custom docker image \* Stack Overflow](<https://stackoverflow.com/questions/57322838/requirements-for-launching-google-cloud-ai-platform-notebooks-with-custom-docker>) {#requirements-for-launching-google-cloud-ai-platform-notebooks-with-custom-docker-image-stack-overflow--https-stackoverflow-dot-com-questions-57322838-requirements-for-launching-google-cloud-ai-platform-notebooks-with-custom-docker}


### [robert-dodier/maxima-jupyter: A Maxima kernel for Jupyter, based on CL-Jupyter (Common Lisp kernel)](<https://github.com/robert-dodier/maxima-jupyter>) {#robert-dodier-maxima-jupyter-a-maxima-kernel-for-jupyter-based-on-cl-jupyter--common-lisp-kernel----https-github-dot-com-robert-dodier-maxima-jupyter}


### [notebooks/Makefile at master · AustinRochford/notebooks](<https://github.com/AustinRochford/notebooks/blob/master/Makefile>) {#notebooks-makefile-at-master-austinrochford-notebooks--https-github-dot-com-austinrochford-notebooks-blob-master-makefile}


## jupyter-maxima {#jupyter-maxima}


### <https://gitlab.com/alessandro.dibella/docker/jupyter-maxima/-/tree/master> {#https-gitlab-dot-com-alessandro-dot-dibella-docker-jupyter-maxima-tree-master}


## nice framework for dockerfiles that inherit from deeplearning ai platform notebooks {#nice-framework-for-dockerfiles-that-inherit-from-deeplearning-ai-platform-notebooks}


### <https://github.com/ZainRizvi/UseRWithGpus> {#https-github-dot-com-zainrizvi-userwithgpus}
